Updated classes names and splitted some classes
